app/views/answers/_show_answers.erb

<% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]