app/controllers/answers_controller.rb

	def create
		@question = Question.find(params[:question_id])
		@answer = @question.answers.create(answer_params)
		@answer.user = current_user

		respond_to do |format|
			if @answer.save!
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("response", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["response", "That's weird\r\n"], ["question_id", 1], ["created_at", 2017-04-15 22:43:56 UTC], ["updated_at", 2017-04-15 22:43:56 UTC]]
UPDATE "answers" SET "updated_at" = ?, "user_id" = ? WHERE "answers"."id" = ?  [["updated_at", 2017-04-15 22:43:56 UTC], ["user_id", 2], ["id", 1]]
UPDATE "questions" SET "answers_count" = COALESCE("answers_count", 0) + 1 WHERE "questions"."id" = ?  [["id", 1]]

	def upvote
		@answer.liked_by current_user
		@answer.save!
---
UPDATE "answers" SET "cached_votes_total" = ?, "cached_votes_up" = ?, "cached_votes_score" = ?, "cached_weighted_total" = ?, "cached_weighted_score" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["cached_votes_total", 1], ["cached_votes_up", 1], ["cached_votes_score", 1], ["cached_weighted_total", 1], ["cached_weighted_score", 1], ["updated_at", 2017-04-15 22:44:01 UTC], ["id", 1]]

		def set_answer
			@answer = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]