app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC
---
	def react_index
		@questions = Question.all

INSERT INTO "questions" ("title", "detail", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Wonder why this breaks"], ["detail", "no idea"], ["created_at", 2017-04-15 22:36:06 UTC], ["updated_at", 2017-04-15 22:36:06 UTC], ["user_id", 1]]
---
	def create
		@question = Question.new(question_params)
		@question.user_id = current_user.id
		respond_to do |format|
			if @question.save!

UPDATE "questions" SET "cached_votes_total" = ?, "cached_votes_up" = ?, "cached_votes_score" = ?, "cached_weighted_total" = ?, "cached_weighted_score" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["cached_votes_total", 1], ["cached_votes_up", 1], ["cached_votes_score", 1], ["cached_weighted_total", 1], ["cached_weighted_score", 1], ["updated_at", 2017-04-15 22:36:41 UTC], ["id", 1]]
---
	def upvote
		@question.liked_by current_user
		@question.save!

UPDATE "questions" SET "cached_votes_up" = ?, "cached_votes_down" = ?, "cached_votes_score" = ?, "cached_weighted_score" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["cached_votes_up", 0], ["cached_votes_down", 1], ["cached_votes_score", -1], ["cached_weighted_score", -1], ["updated_at", 2017-04-15 23:18:22 UTC], ["id", 1]]
UPDATE "votes" SET "updated_at" = ?, "vote_flag" = ? WHERE "votes"."id" = ?  [["updated_at", 2017-04-15 23:18:22 UTC], ["vote_flag", false], ["id", 1]]
---
	def downvote
		@question.downvote_from current_user
		@question.save!