app/controllers/questions/comments_controller.rb

  def create
  	@comment = @commentable.comments.new(comment_params)
  	@comment.user = current_user

  	respond_to do |format|
  		if @comment.save!
---
INSERT INTO "comments" ("commentable_type", "commentable_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commentable_type", "Question"], ["commentable_id", 1], ["body", "hmmmmmmm"], ["created_at", 2017-04-15 22:43:45 UTC], ["updated_at", 2017-04-15 22:43:45 UTC]]

    def set_commentable
      @commentable = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]